InformationRegisters/сфпДоступныеДляПрослушиванияПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>сфпДоступныеДляПрослушиванияПользователи</Name>
			<Comment>Пользователи, доступные для просмотра и прослушивания телефонных переговоров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Comment>Это группа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтролируемыйПользователь</Name>
					<Comment>Контролируемый пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеПерсональногоДоступа</Name>
					<Comment>Пользователь имеет собственные права и настройки, в группе доступа не участвует</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравИНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/сфпДоступныеДляПрослушиванияПользователи/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		Элементы.ГруппаПользователи.Видимость = Ложь;
		ЭтаФорма.ПользовательВладелец = Параметры.Владелец;
		
		Если Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
			  ТекОтбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
		Иначе ТекОтбор = Список.Отбор.Элементы[0];
		КонецЕсли;
		ТекОтбор.ПравоеЗначение = ЭтаФорма.ПользовательВладелец;
		ТекОтбор.Использование = Истина;
	КонецЕсли;

	ЭтаФорма.ТолькоПросмотр	= НЕ сфпСофтФонПроСервер.сфпРолиДоступны("ПолныеПрава, ДобавлениеИзменениеПользователей");

	ЭтаФорма.ИспользоватьГруппыПользователей = сфпСофтФонПроСервер.сфпИспользоватьГруппыПользователей();
	Если ЭтаФорма.ИспользоватьГруппыПользователей Тогда
		ЭтаФорма.Элементы.КонтролируемыйПользователь.Заголовок = НСтр("ru = 'Контролируемый пользователь / группа пользователей'");

	Иначе	
		ЭтаФорма.Элементы.КонтролируемыйПользователь.Заголовок = НСтр("ru = 'Контролируемый пользователь'");
		
		Если Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
			  ТекОтбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1];
		Иначе ТекОтбор = Список.Отбор.Элементы[1];
		КонецЕсли;
		ТекОтбор.ПравоеЗначение = Ложь;
		ТекОтбор.Использование = Истина;
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.ГруппаПользователи.Видимость Тогда
		Возврат;
	КонецЕсли;

	ТекДанные = Элементы.Пользователи.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		  ПользовательВладелец = ТекДанные.Ссылка;
	Иначе ПользовательВладелец = "";
	КонецЕсли;
	
	Если Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
		  ТекОтбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Иначе ТекОтбор = Список.Отбор.Элементы[0];
	КонецЕсли;
	ТекОтбор.ПравоеЗначение = ПользовательВладелец;
	ТекОтбор.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Выбор" таблицы формы "Список"
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ (Поле.Имя = "КонтролируемыйПользователь") Тогда Возврат; КонецЕсли;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока",	Элемент.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ТекущиеДанные",	ТД);
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораПользователя", ЭтаФорма, ДополнительныеПараметры);
	Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	Иначе
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	КонецЕсли;	
КонецПроцедуры // СписокВыбор()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" таблицы формы "Список"
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	Если Копирование Тогда
		ТД = Элемент.ТекущиеДанные;
		Если ТД = Неопределено Тогда Возврат; КонецЕсли;
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
		ДополнительныеПараметры = Новый Структура;
		Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			ДополнительныеПараметры.Вставить("ЭтоГруппа", Истина);
			ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаДобавленияПользователя", ЭтаФорма, ДополнительныеПараметры);
			ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
		Иначе
			ДополнительныеПараметры.Вставить("ЭтоГруппа", Ложь);
			ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаДобавленияПользователя", ЭтаФорма, ДополнительныеПараметры);
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
		КонецЕсли;	
	Иначе
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
		ДополнительныеПараметры.Вставить("ИмяОповещения", "ОбработкаДобавленияПользователя");
		ОповещениеВыбораТипа = Новый ОписаниеОповещения("ОбработкаВыбораТипаПользователя", ЭтаФорма, ДополнительныеПараметры);
		СписокВыбораТипа = Новый СписокЗначений;
		СписокВыбораТипа.Добавить(Истина,	"Группа пользователей");
		СписокВыбораТипа.Добавить(Ложь,		"Пользователь");
		Если ЭтаФорма.ИспользоватьГруппыПользователей Тогда
			СписокВыбораТипа.ПоказатьВыборЭлемента(ОповещениеВыбораТипа, "Выберите тип");
		Иначе
			ОбработкаВыбораТипаПользователя(СписокВыбораТипа[1], ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // СписокПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломИзменения" таблицы формы "Список"
//
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока",	Элемент.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ТекущиеДанные",	ТД);
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораПользователя", ЭтаФорма, ДополнительныеПараметры);
	Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	Иначе
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	КонецЕсли;	
КонецПроцедуры // СписокПередНачаломИзменения()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды формы "ПодборКонтролируемыхПользователей"
//
Процедура ПодборКонтролируемыхПользователей(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",	Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыФормы", ПараметрыФормы);
	ДополнительныеПараметры.Вставить("ИмяОповещения", "Подключаемый_ОбработкаПодбораПользователя");
	ОповещениеВыбораТипа = Новый ОписаниеОповещения("ОбработкаВыбораТипаПользователя", ЭтаФорма, ДополнительныеПараметры);
	СписокВыбораТипа = Новый СписокЗначений;
	СписокВыбораТипа.Добавить(Истина,	"Группа пользователей");
	СписокВыбораТипа.Добавить(Ложь,		"Пользователь");
	Если ЭтаФорма.ИспользоватьГруппыПользователей Тогда
		СписокВыбораТипа.ПоказатьВыборЭлемента(ОповещениеВыбораТипа, "Выберите тип");
	Иначе
		ОбработкаВыбораТипаПользователя(СписокВыбораТипа[1], ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры // ПодборКонтролируемыхПользователей()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция добавляет контролируемого пользователя
//
// Параметры:
//	Пользователь				- СправочникСсылка	- Пользователь
//	КонтролируемыйПользователь	- СправочникСсылка	- Контролируемый пользователь
//	ЭтоГруппа					- Булево			- Признак
//
// Возвращаемое значение:
//	Булево	- Результат добавления
//
Функция ДобавитьКонтролируемогоПользователя(Пользователь, КонтролируемыйПользователь, ЭтоГруппа)
	НоваяЗапись = РегистрыСведений.сфпДоступныеДляПрослушиванияПользователи.СоздатьМенеджерЗаписи();
	НоваяЗапись.Пользователь 				= Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= КонтролируемыйПользователь;
	НоваяЗапись.ЭтоГруппа					= ЭтоГруппа;
	Попытка
		НоваяЗапись.Записать(Истина);
		ЗаписьДобавлена = Истина;
	Исключение
		ЗаписьДобавлена = Ложь;
	КонецПопытки;
	Возврат ЗаписьДобавлена;
КонецФункции // ДобавитьКонтролируемогоПользователя()	

&НаСервереБезКонтекста
// Функция изменяет контролируемого пользователя
//
// Параметры:
//	ЗаписьРегистра				- РегистрСведенийЗапись	- Запись регистра сведений
//	КонтролируемыйПользователь	- СправочникСсылка		- Контролируемый пользователь
//
// Возвращаемое значение:
//	Булево	- Результат изменения
//
Функция ИзменитьКонтролируемогоПользователя(ЗаписьРегистра, КонтролируемыйПользователь)
	НоваяЗапись = РегистрыСведений.сфпДоступныеДляПрослушиванияПользователи.СоздатьМенеджерЗаписи();
	НоваяЗапись.Пользователь 				= ЗаписьРегистра.Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= КонтролируемыйПользователь;
	НоваяЗапись.Прочитать();
	Если НоваяЗапись.Выбран() Тогда Возврат Ложь; КонецЕсли;
	НоваяЗапись.Пользователь 				= ЗаписьРегистра.Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= ЗаписьРегистра.КонтролируемыйПользователь;
	НоваяЗапись.Прочитать();
	Если НЕ НоваяЗапись.Выбран() Тогда Возврат Ложь; КонецЕсли;
	НоваяЗапись.КонтролируемыйПользователь = КонтролируемыйПользователь;
	Попытка
		НоваяЗапись.Записать(Истина);
		ЗаписьИзменена = Истина;
	Исключение
		ЗаписьИзменена = Ложь;
	КонецПопытки;
	Возврат ЗаписьИзменена;
КонецФункции // ИзменитьКонтролируемогоПользователя()	

&НаСервере
// Процедура устанавливает текущую запись в списке
//
// Параметры:
//	Пользователь				- СправочникСсылка	- Пользователь
//	КонтролируемыйПользователь	- СправочникСсылка	- Контролируемый пользователь
//
Процедура УстановитьТекущуюЗапись(Пользователь, КонтролируемыйПользователь)
	Элементы.Список.Обновить();
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Пользователь", Пользователь);
	СтруктураОтбора.Вставить("КонтролируемыйПользователь",  КонтролируемыйПользователь);
	КлючЗаписи = РегистрыСведений.сфпДоступныеДляПрослушиванияПользователи.СоздатьКлючЗаписи(СтруктураОтбора);
	Элементы.Список.ТекущаяСтрока = КлючЗаписи;
КонецПроцедуры // УстановитьТекущуюЗапись()

&НаКлиенте
// Процедура - обработчик выбора пользователя
//
// Параметры:
//	ВыбранныйЭлемент		- СправочникСсылка	- Выбранный пользователь
//	ДополнительныеПараметры	- Структура			- Структура дополнительных параметров
//
Процедура ОбработкаВыбораПользователя(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	ЗаписьИзменена = ИзменитьКонтролируемогоПользователя(ДополнительныеПараметры.ТекущаяСтрока, ВыбранныйЭлемент);
	Если ЗаписьИзменена Тогда
		ДополнительныеПараметры.ТекущиеДанные.КонтролируемыйПользователь = ВыбранныйЭлемент;
		// АльфаАвто
		// Скорее всего не отрабатывает для динамических списков
		//ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.Список.Обновить();
		// Конец АльфаАвто
	КонецЕсли;	
КонецПроцедуры // ОбработкаВыбораПользователя()	

&НаКлиенте
// Процедура - обработчик выбора типа пользователя
//
// Параметры:
//	ВыбранныйТип			- СправочникСсылка	- Выбранный пользователь
//	ДополнительныеПараметры	- Структура			- Структура дополнительных параметров
//
Процедура ОбработкаВыбораТипаПользователя(ВыбранныйТип, ДополнительныеПараметры) Экспорт
	Если ВыбранныйТип = Неопределено Тогда Возврат; КонецЕсли;
	Если ВыбранныйТип.Значение Тогда
		ДополнительныеПараметры.Вставить("ЭтоГруппа", Истина);
		ОписаниеВыбора = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяОповещения, ЭтаФорма, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбора", ДополнительныеПараметры.ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	Иначе
		ДополнительныеПараметры.Вставить("ЭтоГруппа", Ложь);
		ОписаниеВыбора = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяОповещения, ЭтаФорма, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ДополнительныеПараметры.ПараметрыФормы, ЭтаФорма, , , , ОписаниеВыбора);
	КонецЕсли;	
КонецПроцедуры // ОбработкаТипаКонтролируемогоПользователя()	

&НаКлиенте
// Процедура - подключаемый обработчик подбора пользователя
//
// Параметры:
//	МассивПолучателей	- МассивПолучателей	- Массив пользователей
//	Параметры			- Структура			- Структура дополнительных параметров
//
Процедура Подключаемый_ОбработкаПодбораПользователя(МассивПолучателей, ДополнительныеПараметры) Экспорт
	Если МассивПолучателей = Неопределено Тогда Возврат; КонецЕсли;
	Если НЕ ТипЗнч(МассивПолучателей) = Тип("Массив") Тогда Возврат; КонецЕсли;
	ЗаписьДобавлена = Ложь;	
	ВыбранныйЭлемент = Неопределено;
	Для Каждого СтрокаМассива Из МассивПолучателей Цикл
		Если ДобавитьКонтролируемогоПользователя(ЭтаФорма.ПользовательВладелец, СтрокаМассива, ДополнительныеПараметры.ЭтоГруппа) Тогда
			ЗаписьДобавлена = Истина;	
			ВыбранныйЭлемент = СтрокаМассива;
		КонецЕсли;	
	КонецЦикла;
	Если ЗаписьДобавлена Тогда
		УстановитьТекущуюЗапись(ЭтаФорма.ПользовательВладелец, ВыбранныйЭлемент);
	КонецЕсли;	
КонецПроцедуры // Подключаемый_ОбработкаПодбораПользователя()	

&НаКлиенте
// Процедура - обработчик добавления пользователя
//
// Параметры:
//	ВыбранныйЭлемент		- СправочникСсылка	- Выбранный пользователь
//	ДополнительныеПараметры	- Структура			- Структура дополнительных параметров
//
Процедура ОбработкаДобавленияПользователя(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	ЗаписьДобавлена = ДобавитьКонтролируемогоПользователя(ЭтаФорма.ПользовательВладелец, ВыбранныйЭлемент, ДополнительныеПараметры.ЭтоГруппа);
	Если ЗаписьДобавлена Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры // ОбработкаДобавленияПользователя()	

#КонецОбласти
